# Taps
tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "lars-derichter/mycasks"

# Brews
brew "asdf"
brew "chezmoi"
brew "coreutils"
brew "curl"
brew "direnv"
brew "findutils"
brew "git"
brew "git-extras"
brew "git-lfs"
brew "gnu-sed"
brew "go"
brew "gpg"
brew "mas"
brew "moreutils"
brew "pinentry-mac"
brew "starship"
brew "tldr"
brew "wget"
brew "zsh"

# Casks
cask "1password"
cask "1password-cli"
cask "alfred"
cask "font-fira-code-nerd-font"
cask "font-source-code-pro-for-powerline"
cask "google-chrome"
cask "intellij-idea"
cask "iterm2"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-word"
cask "onedrive"
cask "setapp"
cask "visual-studio-code"

# Mas
mas "BetterSnapTool", id: 417375580
