# Taps
tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "lars-derichter/mycasks"

# Brews
brew "asdf"
brew "chezmoi"
brew "coreutils"
brew "curl"
brew "findutils"
brew "git"
brew "git-extras"
brew "git-lfs"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "mas"
brew "moreutils"
brew "mosquitto"
brew "pandoc"
brew "pinentry-mac"
brew "starship"
brew "tldr"
brew "wget"
brew "zsh"

# Casks
cask "1password"
cask "1password-cli"
cask "alfred"
cask "arduino-ide"
cask "claude"
cask "font-fira-code-nerd-font"
cask "font-playwrite-be-vlg"
font "font-playwrite-be-vlg-guides"
cask "font-source-code-pro-for-powerline"
cask "google-chrome"
cask "imageoptim"
cask "iterm2"
cask "jetbrains-toolbox"
cask "keycastr"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-teams"
cask "microsoft-word"
cask "obsidian"
cask "onedrive"
cask "parallels"
cask "postman"
cask "setapp"
cask "steam"
cask "todoist"
cask "visual-studio-code"
cask "whatsapp"

# Mas
mas "BetterSnapTool", id: 417375580
mas "Kindle", id: 302584613
mas "NordVPN", id: 905953485
mas "Pages", id: 409201541
