# Taps
tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "lars-derichter/mycasks"

# Brews
brew "chezmoi"
brew "coreutils"
brew "curl"
brew "ffmpeg"
brew "findutils"
brew "git"
brew "git-extras"
brew "git-lfs"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "hugo"
brew "mas"
brew "mise"
brew "moreutils"
brew "pandoc"
brew "pinentry-mac"
brew "starship"
brew "tldr"
brew "uv"
brew "wget"
brew "zsh"

# Casks
cask "1password"
cask "1password-cli"
cask "alfred"
cask "arduino-ide"
cask "autodesk-fusion"
cask "bambu-connect"
cask "bambu-studio"
cask "chitubox"
cask "claude"
cask "claude-code"
cask "font-fira-code-nerd-font"
cask "font-inconsolata"
cask "font-inter"
cask "font-lato"
cask "font-material-icons"
cask "font-noto-sans"
cask "font-nunito"
cask "font-open-sans"
cask "font-playwrite-be-vlg"
font "font-playwrite-be-vlg-guides"
cask "font-raleway"
cask "font-roboto"
cask "font-source-code-pro-for-powerline"
cask "google-chrome"
cask "imageoptim"
cask "iterm2"
cask "jetbrains-toolbox"
cask "keycastr"
cask "lycheeslicer"
cask "logi-options+"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-teams"
cask "microsoft-word"
cask "obsidian"
cask "onedrive"
cask "parallels"
cask "postman"
cask "roon"
cask "setapp"
cask "steam"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"

# Mas
mas "Kindle", id: 302584613
mas "NordVPN", id: 905953485
mas "Pages", id: 409201541

go "github.com/catilac/plistwatch"